zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/edc/PIC32CZ2038CA70100.PIC
      <edc:SFRDef edc:_addr="0x40020038" edc:access="--------wwwwwwwwwwwwwwww----w--w" edc:cname="PWMC0_IDR2" edc:nzwidth="0x20" ltx:memberofperipheral="PWMC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WRDY" edc:desc="Write Ready for Synchronous Channels Update Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:desc="Synchronous Channels Update Underrun Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CMPM0" edc:desc="Comparison 0 Match Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPM1" edc:desc="Comparison 1 Match Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPM2" edc:desc="Comparison 2 Match Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPM3" edc:desc="Comparison 3 Match Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPM4" edc:desc="Comparison 4 Match Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPM5" edc:desc="Comparison 5 Match Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPM6" edc:desc="Comparison 6 Match Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPM7" edc:desc="Comparison 7 Match Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPU0" edc:desc="Comparison 0 Update Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPU1" edc:desc="Comparison 1 Update Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPU2" edc:desc="Comparison 2 Update Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPU3" edc:desc="Comparison 3 Update Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPU4" edc:desc="Comparison 4 Update Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPU5" edc:desc="Comparison 5 Update Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPU6" edc:desc="Comparison 6 Update Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPU7" edc:desc="Comparison 7 Update Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002003C" edc:access="--------rrrrrrrrrrrrrrrr----r--r" edc:cname="PWMC0_IMR2" edc:nzwidth="0x20" ltx:memberofperipheral="PWMC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WRDY" edc:desc="Write Ready for Synchronous Channels Update Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:desc="Synchronous Channels Update Underrun Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CMPM0" edc:desc="Comparison 0 Match Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPM1" edc:desc="Comparison 1 Match Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPM2" edc:desc="Comparison 2 Match Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPM3" edc:desc="Comparison 3 Match Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPM4" edc:desc="Comparison 4 Match Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPM5" edc:desc="Comparison 5 Match Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPM6" edc:desc="Comparison 6 Match Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPM7" edc:desc="Comparison 7 Match Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPU0" edc:desc="Comparison 0 Update Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPU1" edc:desc="Comparison 1 Update Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPU2" edc:desc="Comparison 2 Update Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPU3" edc:desc="Comparison 3 Update Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPU4" edc:desc="Comparison 4 Update Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPU5" edc:desc="Comparison 5 Update Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPU6" edc:desc="Comparison 6 Update Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPU7" edc:desc="Comparison 7 Update Interrupt Mask" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020040" edc:access="--------rrrrrrrrrrrrrrrr----r--r" edc:cname="PWMC0_ISR2" edc:nzwidth="0x20" ltx:memberofperipheral="PWMC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WRDY" edc:desc="Write Ready for Synchronous Channels Update" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:desc="Synchronous Channels Update Underrun Error" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CMPM0" edc:desc="Comparison 0 Match" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPM1" edc:desc="Comparison 1 Match" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPM2" edc:desc="Comparison 2 Match" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPM3" edc:desc="Comparison 3 Match" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPM4" edc:desc="Comparison 4 Match" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPM5" edc:desc="Comparison 5 Match" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPM6" edc:desc="Comparison 6 Match" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPM7" edc:desc="Comparison 7 Match" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPU0" edc:desc="Comparison 0 Update" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPU1" edc:desc="Comparison 1 Update" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPU2" edc:desc="Comparison 2 Update" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPU3" edc:desc="Comparison 3 Update" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPU4" edc:desc="Comparison 4 Update" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPU5" edc:desc="Comparison 5 Update" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPU6" edc:desc="Comparison 6 Update" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPU7" edc:desc="Comparison 7 Update" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020044" edc:access="------------nnnn------------nnnn" edc:cname="PWMC0_OOV" edc:nzwidth="0x20" ltx:memberofperipheral="PWMC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OOVH0" edc:desc="Output Override Value for PWMH output of the channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OOVH1" edc:desc="Output Override Value for PWMH output of the channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OOVH2" edc:desc="Output Override Value for PWMH output of the channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OOVH3" edc:desc="Output Override Value for PWMH output of the channel 3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="OOVL0" edc:desc="Output Override Value for PWML output of the channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OOVL1" edc:desc="Output Override Value for PWML output of the channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OOVL2" edc:desc="Output Override Value for PWML output of the channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OOVL3" edc:desc="Output Override Value for PWML output of the channel 3" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020048" edc:access="------------nnnn------------nnnn" edc:cname="PWMC0_OS" edc:nzwidth="0x20" ltx:memberofperipheral="PWMC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OSH0" edc:desc="Output Selection for PWMH output of the channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSH1" edc:desc="Output Selection for PWMH output of the channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSH2" edc:desc="Output Selection for PWMH output of the channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSH3" edc:desc="Output Selection for PWMH output of the channel 3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="OSL0" edc:desc="Output Selection for PWML output of the channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSL1" edc:desc="Output Selection for PWML output of the channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSL2" edc:desc="Output Selection for PWML output of the channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSL3" edc:desc="Output Selection for PWML output of the channel 3" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
