zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/edc/PIC32CZ2038CA70100.PIC
      <edc:AdjustPoint edc:_addr="0x4005C404" edc:offset="0x1C"/>
      <edc:SFRDef edc:_addr="0x4005C420" edc:access="------------------w---w---------" edc:cname="PWMC1_CMUPD1" edc:nzwidth="0x20" ltx:memberofperipheral="PWMC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="CPOLUP" edc:desc="Channel Polarity Update" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CPOLINVUP" edc:desc="Channel Polarity Inversion Update" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4005C424" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x4005C42C" edc:access="nnnn--nnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PWMC1_ETRG1" edc:nzwidth="0x20" ltx:memberofperipheral="PWMC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MAXCNT" edc:desc="Maximum Counter value" edc:nzwidth="0x18"/>
            <edc:SFRFieldDef edc:cname="TRGMODE" edc:desc="External Trigger Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="External trigger is not enabled." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MODE1" edc:desc="External PWM Reset Mode" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MODE2" edc:desc="External PWM Start Mode" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MODE3" edc:desc="Cycle-by-cycle Duty Mode" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TRGEDGE" edc:desc="Edge Selection" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="FALLING_ZERO" edc:desc="TRGMODE = 1: TRGINx event detection on falling edge.TRGMODE = 2, 3: TRGINx active level is 0" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RISING_ONE" edc:desc="TRGMODE = 1: TRGINx event detection on rising edge.TRGMODE = 2, 3: TRGINx active level is 1" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TRGFILT" edc:desc="Filtered input" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRGSRC" edc:desc="Trigger Source" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RFEN" edc:desc="Recoverable Fault Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C430" edc:access="------------nnnn---------nnnnnnn" edc:cname="PWMC1_LEBR1" edc:nzwidth="0x20" ltx:memberofperipheral="PWMC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LEBDELAY" edc:desc="Leading-Edge Blanking Delay for TRGINx" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="PWMLFEN" edc:desc="PWML Falling Edge Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWMLREN" edc:desc="PWML Rising Edge Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWMHFEN" edc:desc="PWMH Falling Edge Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWMHREN" edc:desc="PWMH Rising Edge Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4005C434" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x4005C440" edc:access="------------------w---w---------" edc:cname="PWMC1_CMUPD2" edc:nzwidth="0x20" ltx:memberofperipheral="PWMC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="CPOLUP" edc:desc="Channel Polarity Update" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CPOLINVUP" edc:desc="Channel Polarity Inversion Update" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4005C444" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x4005C44C" edc:access="nnnn--nnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PWMC1_ETRG2" edc:nzwidth="0x20" ltx:memberofperipheral="PWMC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MAXCNT" edc:desc="Maximum Counter value" edc:nzwidth="0x18"/>
            <edc:SFRFieldDef edc:cname="TRGMODE" edc:desc="External Trigger Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="External trigger is not enabled." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MODE1" edc:desc="External PWM Reset Mode" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MODE2" edc:desc="External PWM Start Mode" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MODE3" edc:desc="Cycle-by-cycle Duty Mode" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TRGEDGE" edc:desc="Edge Selection" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="FALLING_ZERO" edc:desc="TRGMODE = 1: TRGINx event detection on falling edge.TRGMODE = 2, 3: TRGINx active level is 0" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RISING_ONE" edc:desc="TRGMODE = 1: TRGINx event detection on rising edge.TRGMODE = 2, 3: TRGINx active level is 1" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TRGFILT" edc:desc="Filtered input" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRGSRC" edc:desc="Trigger Source" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RFEN" edc:desc="Recoverable Fault Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C450" edc:access="------------nnnn---------nnnnnnn" edc:cname="PWMC1_LEBR2" edc:nzwidth="0x20" ltx:memberofperipheral="PWMC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LEBDELAY" edc:desc="Leading-Edge Blanking Delay for TRGINx" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="PWMLFEN" edc:desc="PWML Falling Edge Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWMLREN" edc:desc="PWML Rising Edge Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWMHFEN" edc:desc="PWMH Falling Edge Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWMHREN" edc:desc="PWMH Rising Edge Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4005C454" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x4005C460" edc:access="------------------w---w---------" edc:cname="PWMC1_CMUPD3" edc:nzwidth="0x20" ltx:memberofperipheral="PWMC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="CPOLUP" edc:desc="Channel Polarity Update" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CPOLINVUP" edc:desc="Channel Polarity Inversion Update" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4005C464" edc:offset="0x3B9C"/>
      <edc:SFRDef edc:_addr="0x40060000" edc:access="--ww-w-w------wwwwwwwwwwwwwwwwww" edc:cname="TWI2_CR" edc:nzwidth="0x20" ltx:memberofperipheral="TWI2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="START" edc:desc="Send a START Condition" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STOP" edc:desc="Send a STOP Condition" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MSEN" edc:desc="TWI Master Mode Enabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MSDIS" edc:desc="TWI Master Mode Disabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SVEN" edc:desc="TWI Slave Mode Enabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SVDIS" edc:desc="TWI Slave Mode Disabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QUICK" edc:desc="SMBus Quick Command" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HSEN" edc:desc="TWI High-Speed Mode Enabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HSDIS" edc:desc="TWI High-Speed Mode Disabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMBEN" edc:desc="SMBus Mode Enabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMBDIS" edc:desc="SMBus Mode Disabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PECEN" edc:desc="Packet Error Checking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PECDIS" edc:desc="Packet Error Checking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PECRQ" edc:desc="PEC Request" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLEAR" edc:desc="Bus CLEAR Command" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ACMEN" edc:desc="Alternative Command Mode Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ACMDIS" edc:desc="Alternative Command Mode Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="THRCLR" edc:desc="Transmit Holding Register Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCKCLR" edc:desc="Lock Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOEN" edc:desc="FIFO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFODIS" edc:desc="FIFO Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40060004" edc:access="---------nnnnnnn---n--nn--------" edc:cname="TWI2_MMR" edc:nzwidth="0x20" ltx:memberofperipheral="TWI2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="IADRSZ" edc:desc="Internal Device Address Size" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No internal device address" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_BYTE" edc:desc="One-byte internal device address" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BYTE" edc:desc="Two-byte internal device address" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_BYTE" edc:desc="Three-byte internal device address" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MREAD" edc:desc="Master Read Direction" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DADR" edc:desc="Device Address" edc:nzwidth="0x7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
