zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/edc/PIC32CZ2038CA70100.PIC
      <edc:SFRDef edc:_addr="0x40060008" edc:access="nnnn-----nnnnnnn-nnnnnnn-n--nn-n" edc:cname="TWI2_SMR" edc:nzwidth="0x20" ltx:memberofperipheral="TWI2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NACKEN" edc:desc="Slave Receiver Data Phase NACK enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SMDA" edc:desc="SMBus Default Address" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMHH" edc:desc="SMBus Host Header" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SCLWSDIS" edc:desc="Clock Wait State Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MASK" edc:desc="Slave Address Mask" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SADR" edc:desc="Slave Address" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SADR1EN" edc:desc="Slave Address 1 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SADR2EN" edc:desc="Slave Address 2 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SADR3EN" edc:desc="Slave Address 3 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAMEN" edc:desc="Data Matching Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4006000C" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="TWI2_IADR" edc:nzwidth="0x20" ltx:memberofperipheral="TWI2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IADR" edc:desc="Internal Address" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40060010" edc:access="--nnnnnn-----nnnnnnnnnnnnnnnnnnn" edc:cname="TWI2_CWGR" edc:nzwidth="0x20" ltx:memberofperipheral="TWI2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLDIV" edc:desc="Clock Low Divider" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="CHDIV" edc:desc="Clock High Divider" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="CKDIV" edc:desc="Clock Divider" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="HOLD" edc:desc="TWD Hold Time Versus TWCK Falling" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40060014" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x40060020" edc:access="------rr--rrrr-r----rrrrrrrrrrrr" edc:cname="TWI2_SR" edc:nzwidth="0x20" ltx:memberofperipheral="TWI2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXCOMP" edc:desc="Transmission Completed (cleared by writing TWI_THR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Receive Holding Register Ready (cleared by reading TWI_RHR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Transmit Holding Register Ready (cleared by writing TWI_THR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SVREAD" edc:desc="Slave Read" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SVACC" edc:desc="Slave Access" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GACC" edc:desc="General Call Access (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:desc="Underrun Error (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NACK" edc:desc="Not Acknowledged (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARBLST" edc:desc="Arbitration Lost (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCLWS" edc:desc="Clock Wait State" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOSACC" edc:desc="End Of Slave Access (cleared on read)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MCACK" edc:desc="Master Code Acknowledge (cleared on read)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TOUT" edc:desc="Timeout Error (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PECERR" edc:desc="PEC Error (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMBDAM" edc:desc="SMBus Default Address Match (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMBHHM" edc:desc="SMBus Host Header Address Match (cleared on read)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SCL" edc:desc="SCL Line Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SDA" edc:desc="SDA Line Value" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40060024" edc:access="----------wwww-w----wwwwwwww-www" edc:cname="TWI2_IER" edc:nzwidth="0x20" ltx:memberofperipheral="TWI2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXCOMP" edc:desc="Transmission Completed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Receive Holding Register Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Transmit Holding Register Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SVACC" edc:desc="Slave Access Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GACC" edc:desc="General Call Access Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:desc="Underrun Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NACK" edc:desc="Not Acknowledge Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARBLST" edc:desc="Arbitration Lost Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCL_WS" edc:desc="Clock Wait State Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOSACC" edc:desc="End Of Slave Access Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MCACK" edc:desc="Master Code Acknowledge Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TOUT" edc:desc="Timeout Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PECERR" edc:desc="PEC Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMBDAM" edc:desc="SMBus Default Address Match Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMBHHM" edc:desc="SMBus Host Header Address Match Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
